In [1]:
import numpy as np
import pandas as pd

In [11]:
data={'Company':['Goog','Goog','MSFT','MSFT','FB','FB']
      ,'Person':['Mahmoud','Adam','Eyad','Aya','Sara','Usama']
     ,'Sales':[5,4,3,8,7,9]}

In [13]:
df = pd.DataFrame(data)

In [14]:
df

  Company   Person  Sales
0    Goog  Mahmoud      5
1    Goog     Adam      4
2    MSFT     Eyad      3
3    MSFT      Aya      8
4      FB     Sara      7
5      FB    Usama      9

In [15]:
df.groupby('Company').mean()

         Sales
Company
FB         8.0
Goog       4.5
MSFT       5.5

In [16]:
df.groupby('Company').sum()

         Sales
Company
FB          16
Goog         9
MSFT        11

In [17]:
df.groupby('Company').sum().loc['FB']

Sales    16
Name: FB, dtype: int64

In [18]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
Goog          2      2
MSFT          2      2

In [19]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Usama      9
Goog     Mahmoud      5
MSFT        Eyad      8

In [20]:
df.groupby('Company').describe()

        Sales
        count mean       std  min   25%  50%   75%  max
Company
FB        2.0  8.0  1.414214  7.0  7.50  8.0  8.50  9.0
Goog      2.0  4.5  0.707107  4.0  4.25  4.5  4.75  5.0
MSFT      2.0  5.5  3.535534  3.0  4.25  5.5  6.75  8.0

In [21]:
df.groupby('Company').describe().transpose()

Company            FB      Goog      MSFT
Sales count  2.000000  2.000000  2.000000
      mean   8.000000  4.500000  5.500000
      std    1.414214  0.707107  3.535534
      min    7.000000  4.000000  3.000000
      25%    7.500000  4.250000  4.250000
      50%    8.000000  4.500000  5.500000
      75%    8.500000  4.750000  6.750000
      max    9.000000  5.000000  8.000000